'''Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в
один рядок через кому. Отримайте для масиву середнє арифметичне.
Анна Феферман'''

array = [] # ініціалізуємо порожній масив
summa = 0 # заводимо змінну для суми
for i in range(5):
    array.append(int(input(f'Input {i+1} element: '))) # 5 разів поелементно заповнюємо масив
for el in array:
    summa += el # додаємо до суми елемент з масиву
print(f'Ваш масив:{array},\n' # виводимо масив
      f'Середнє арифметичне: {summa/5}') # розраховуємо середнє арифметичне