"""Знайти суму парних елементів масиву цілих чисел. Розмірність масиву -
20. Заповнення масиву здійснити випадковими числами від 100 до 200.
Anna Feferman"""

from random import randint  # імортуємо рандом

array = []  # створюємо порожній масив
summa = 0  # заводимо змінну для суми
for i in range(20):
    array.append(randint(100, 200))  # заповнюємо масив елементами в діапазоні від 100 до 200
for el in array:
    if el % 2 == 0:  # перевіряємо, чи парне число
        summa += el  # якщо так, додаємо у змінну суми
        continue
print(f'Сума: {summa}')  # виводимо результат
