"""Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність
масиву - 15. Заповнення масиву здійснити випадковими числами від 10 до 50.
Anna Feferman"""

from random import randint  # імортуємо рандом

array = []  # створюємо порожній масив
dobutok = 1  # заводимо змінну для добутку
for i in range(15):
    array.append(randint(10, 50))  # заповнюємо масив елементами в діапазоні від 10 до 50
for el in array:
    if el % 7 == 0:  # перевіряємо, чи кратне число 7
        dobutok *= el  # якщо так, множимо на змінну добутку
        continue
print(f'Добуток: {dobutok}')  # виводимо результат
