"""Знайти суму елементів масиву дійсних чисел, що мають непарні номери.
Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 100
до 200.
Anna Feferman"""

from random import randint  # імортуємо рандом

array = []  # створюємо порожній масив
summa = 0  # заводимо змінну для суми
for i in range(20):
    array.append(randint(100, 200))  # заповнюємо масив елементами в діапазоні від 100 до 200
for index in range(0, len(array), 2):  # проходимо циклом по елементам з непарними індексами
    summa += array[index]  # додаємо елемент до суми
print(array)
print(f'Сума: {summa}')  # виводимо результат
