"""Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.
Anna Feferman"""

array = []  # створюємо порожній список
dobutok = 1  # заводимо змінну для добутку
for i in range(10):
    array.append(int(input(f'Input {i + 1} element: ')))  # користувач заповнює масив поелементно
print(array)
for el in array:
    if el < 0:  # перевіряємо чи елемент від'ємний
        dobutok *= el  # якщо так, множимо його на змінну добутку
print(f'Dobutok: {dobutok}')
