"""Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:
остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 200 до 300.
Anna Feferman"""


from random import randint  # імортуємо рандом

array = []  # створюємо порожній масив
summa = 0  # заводимо змінну для суми
for i in range(20):
    array.append(randint(200, 300))  # заповнюємо масив елементами в діапазоні від 200 до 300
for el in array:  # проходимо циклом по елементам масиву
    if el % 2 == 3:  # додаємо елемент до суми
        summa += el
print(array)
print(f'Сума: {summa}')  # виводимо результат
# але відповіть завжди дорівнює нулю, оскільки остача від ділення на 2 не може бути більше трьох
