'''Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на
екран значення коріння і квадратів кожного з елементів масиву.
Анна Феферман'''

from math import sqrt # імпортуємо math


array = [] # ініціалізуємо порожній масив
for i in range(5):
    array.append(int(input(f'Input {i+1} element: '))) # 5 разів поелементно заповнюємо масив
for el in array:
    print(f'{el}^2 = {el**2},\n'  # підносимо до квадрату кожен елемент
          f'sqrt({el}) = {sqrt(el)}') # беремо корінь з кожного елемента