"""Знайти добуток елементів масиву, кратних 3 і 9. Розмірність масиву - 10.
Заповнення масиву здійснити випадковими числами від 5 до 500.
Anna Feferman"""

from random import randint  # імпортуємо рандом

array = []  # порожній масив
dobutok = 1  # зміна добутку
for i in range(10):
    array.append(randint(5, 500))  # заповнюємо список рандомом від 5 до 500
print(array)
for el in array:
    if el % 3 == 0 or el % 9 == 0:  # перевіряємо, чи кратний елемент 3 і 9
        dobutok *= el  # збільшуєму змінну добутку на це значення, якщо так
        continue
if dobutok == 1:
    print(f'Значень, кратних 3 і 9 не знайдено.')
else:
    print(f'Добуток: {dobutok}')
