"""Знайти суму всіх елементів масиву цілих чисел, які менше середнього
арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 150 до 300.
Anna Feferman"""


from random import randint  # імпортуємо рандом

array = []  # масив порожній
dobutok = 1  # зміна добутку
for i in range(20):
    array.append(randint(150, 300))  # заповнюємо список рандомом від 150 до 300
print(array)
ser_ar = sum(array)/len(array)
for el in array:
    if el < ser_ar:  # порівнюємо значення з середнім арифметичним
        dobutok *= el  # збільшуєму змінну добутку на це значення
        continue
print(f'Добуток: {dobutok}')