"""Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8
одночасно. Розмірність масиву - 30. Заповнення масиву здійснити випадковими
числами від 500 до 1000.
Anna Feferman"""

from random import randint  # імпортуємо рандом

array = []  # порожній масив
summa = 0  # зміна суми
for i in range(30):
    array.append(randint(500, 1000))  # заповнюємо список рандомом від 500 до 1000
print(array)
for el in array:
    if el % 5 == 0 and el % 8 == 0:  # перевіряємо, чи кратний елемент 5 і 8 одночасно
        summa += el  # збільшуєму змінну суми на це значення, якщо так
        continue
if summa == 1:
    print(f'Значень, кратних 5 і 8 не знайдено.')
else:
    print(f'Сума: {summa}')