"""Знайти добуток елементів лінійного масиву цілих чисел, які кратні 5.
Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами від 10 до
100.
Anna Feferman"""

from random import randint  # імпортуємо рандом

array = []  # порожній масив
dobutok = 1  # зміна добутку
for i in range(10):
    array.append(randint(10, 100))  # заповнюємо список рандомом від 500 до 1000
print(array)
for el in array:
    if el % 5 == 0:  # перевіряємо, чи кратний елемент 5
        dobutok *= el  # збільшуєму змінну добутку на це значення, якщо так
        continue
if dobutok == 1:
    print(f'Значень, кратних 5 не знайдено.')
else:
    print(f'Добуток: {dobutok}')