"""Перетин даху має форму півкола з радіусом R м. Сформувати таблицю,
яка містить довжини опор, які встановлюються через кожні R / 5 м.
Anna Feferman"""

import math  # імпортуємо math

radius = int(input('Введіть радіус: '))  # користувач вводить радіус
interval = radius / 5  # зазначаємо інтервал встановлення опор
# встановлюємо початкові значенння
x = 0
i = 0

while x < 2 * radius - interval:  # користуємося формулою розрахунку
    x = x + interval
    i += 1
    h = math.sqrt(x * (2 * radius - x))  # використовуємо math
    print(f'Висота {i} опори: {h.__round__(2)}')  # виводимо опори, одночасно округлюючи їх значення
