"""Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
назву першого товару з таблиці.
Anna Feferman"""

array = []  # створюємо порожній список
b = []  # створюємо порожній список
length = int(input('Введіть кількість товарів: '))  # довжина масиву
for i in range(length):
    array.append(input('Введіть назву товару: '))  # заповнюємо
first = array[0]  # визначаємо перший елемент
for index in range(1, length):
    if array[index] != first: # копіюємо елементи в інший список, якщо умова виконана
        b.append(array[index])
    else:
        continue # проупскаємо, якщо ні
print(b)
