"""Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки
за ці послуги. Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень.
Anna Feferman"""

posluga = []
vartist = []
G = int(input('Input G: '))  # користувач вводить ціну G для порівняння з нею
for i in range(int(input('Input number: '))):
    posluga.append(input('Введіть послугу: '))  # користувач вводить назви послуг
    vartist.append(int(input('Введіть вартість: ')))  # користувач вводить ціни послуг
if G in vartist:
    for i in range(vartist.index(G)):  # обираємо лише ті елементи, що йдуть до G
        print(f'Послуга: {posluga[i]}    Вартість: {vartist[i]}')  # і формуємо таблицю, якщо G є в списку цін
else:
    print('Введенної ціни G немає в списку.')
