"""Створіть масив А [1..7] за допомогою генератора випадкових чисел і
виведіть його на екран. Збільште всі його елементи в 2 рази.
Anna Feferman"""

from random import randint  # імпортуємо рандом

array = []  # створюємо порожні масиви
new_array = []
for i in range(7):
    array.append(randint(0, 10))  # заповнюємо масив випадковими числами в діапазоні 0 - 10
print(array)  # виводимо на екран
for i in array:
    new_array.append(i * 2)  # додаємо в порожній масив елементи вихідного, збільшені вдвічі
print(new_array)  # виводимо на екран
