"""У лотереї розігрувалося 100 квитків. Таблиця містить 10 номерів
виграшних квитків. Перевірте, чи є квиток з номером N виграшним.
Anna Feferman"""

from random import randint # імпортуємо рандом

vygrashni = [] # список виграшних квитків (у 10 заповнимо рандінтом)
kvytok = int(input('Введіть номер вашого квитка: ')) # номер квитка користувача
for i in range(100):
    vygrashni.append(randint(0, 100))
if kvytok in vygrashni: # перевіряємо чи є номер в списку
    print('Квиток з номером', kvytok, 'є виграшним!')
else:
    print('Квиток з номером', kvytok, 'не є виграшним :(')