"""Дан одновимірний масив з 10 цілих чисел. Підрахуйте кількість різних
чисел в ньому.
Anna Feferman"""

from random import randint  # імпортуємо рандом

array = []  # порожній список
for i in range(10):
    array.append(randint(0, 7))  # заповнюємо рандінтом
print(array)  # виводимо список
print('Різних чисел: ', len(set(array)))  # перетворюємо на множину і рахуємо її довжину
