"""Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
елементів масиву.
Anna Feferman"""


from random import randint  # імпортуємо рандом

array = []  # створюємо порожній масив
count = 0 # заводимо змінну, що буде рахувати від'ємні числа
for i in range(8):
    array.append(randint(-10, 10))  # заповнюємо масив випадковими числами в діапазоні -10 - +10
print(array)  # виводимо на екран
for el in array:
    if el < 0:  # порівнюємо кожен елемент з нулем
        count += 1  # збільшуємо змінну на одиницю, якщо знайдено елемент менший за нуль
    else:
        continue
print(f"{count} від'ємних ")  # виводимо на екран
