"""Створіть масив А [1..12] за допомогою генератора випадкових чисел з
елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
масиву числом 0.
Anna Feferman"""

from random import randint  # імпортуємо рандом

array = []  # створюємо порожній масив
for i in range(12):
    array.append(randint(-20, 10))  # заповнюємо масив випадковими числами в діапазоні -20 - +10
print(array)  # виводимо на екран
for i in range(len(array)):
    if array[i] < 0:  # порівнюємо кожен елемент з нулем
        array[i] = 0  # якщо знайдено елемент менший за нуль, присвоюємо йому значення нуля
    else:
        continue
print(array)  # виводимо результат
