"""Створіть цілочисельний масив А [1..15] за допомогою генератора
випадкових чисел з елементами від -15 до 30 і виведіть його на екран. Визначте
найбільший елемент масиву і його індекс.
Anna Feferman"""

from random import randint  # імпортуємо рандом

array = []  # створюємо порожній масив
for i in range(15):
    array.append(randint(-15, 30))  # заповнюємо масив випадковими числами в діапазоні -15 - +30
print(array)  # виводимо на екран
for i in range(len(array)):
    if array[i] == max(array):  # порівнюємо кожен елемент зі значенням максимального елемента
        print(f'Найбільший елемент: {max(array)}, індекс: {i}') # виводимо результат